'===========================================GIT============================================'
'это распределенная система контроля версии (это система, записывающая изменения файл или набор файлов в течении времени). Педназаченнаядля отслеживания и введения истории изменении файлов в вашем проекте'

'=========================================GITHUB====================================================='
' это сайт куда я могу отправить все что находится на моем ноутбуке, что бы лругие люди могли просматривать мой код и мой прогресс, так же использовать код'

'Репозитории - это хранилище проекта (локальный и удаленный)'
#локальный на ноутбуке 
#удаленный на каком то сервисе который предоставляет реозиторий(GITHUB)
