#Переменные - это ссылки на ячеку памяти, где хранятся какие то данные для дальнейшего использования этих данных

# num1 = 55
# num2 = 10
# num3 = 67
# print(num1 + num2 - num3)

# #Правила наименования переменных
# #a = 5 можно но назнаечения не понятное
# # num = 20 нельзя называть переменные с числами
# # my name = 'das' - нельзя использовать пробелы
# #my)name - нельзя использовать символы кроме нижнего подчеркивания
# #print = ('makers') - нельзя использовать встроенные названия функции комманд операторов

# #имя = 'makers' - нельзя писать названия на кирилице

# #Snake case - python style 
# my_name = 'das'
# #Camel Case - стиль остальных языков программирования
# myName = 'das'
# 'Ввод и вывод данных'
# #print - вывод данных с терминала
# #input - ввод данных с терминала 
#number = input('Введите число: ')
#print(number)
#Типы данных
#Типы данных на питоне делятся на два
#Изменяемые и не изменяемые

#'Изменяемые'
#list
#set
#dict

#'Неизменяемые'
#int - float, decimal, complex
#str
#tuple
#bool
#Nano
#Frozenset

#'Integer'
#int - целые числа
#float - целые числа с плавающей точкой(15.9)
#decimal - числа с плавающей точкой но с большим диапазоном чисел после точки(15.29038923)
#complex - числа из выш. математики (5j)
#int - переводит текст с числом в тип данных число

# + 10 + 10 - сложение
# - 10 - 10 - вычитание
# * 10 * 5 - умножение
# / 10 / 5 - деление
# // 10 / 5 -деление целочисленного
# % 10 % 3 - остаток от деления
# ** 10 ** 2 возведение в степень

